enchant();

//変数宣言
var game;

//Webページが読み込まれたら
addEventListener( 'load', function() {
	game = new Core(320,320);	//ゲームオブジェクトの作成
  // フレームレートの設定。15fpsに設定
  game.fps = 15;//ゲーム画面のフレームレート　毎秒１５枚のアニメーションで構成
	game.preload( '../img/character/Gilbert2.png' );	//画像をプリロード
  game.preload('../img/map/map1.png');
  //game.preload('img/map/map2.png');


  //マップとの接触判定　いらない
  /*
  function bottom_collisionCheck(mapName,splite){
      if(mapName.hitTest(splite.x+32 ,splite.y + 16 )){
          console.log("通れない："+ (splite.x + 32));
          return true;
      }else{
          return false;
      }
  }
  */

  game.onload = function(){
      game.pushScene( game.mainScene() );		//シーンをゲームに追加する

    //zキーでの入力をaボタンに設定
    game.keybind( 'Z'.charCodeAt(0), 'a' );

    game.onload = function(){


  //メインシーン
	game.mainScene = function() {
		var scene = new Scene();		//シーンを作成
		//scene.backgroundColor = '#00BFFF';	//ブロックおいてないとこの色（前まで白色だったとこ）
        game.rootScene.backgroundColor = '#fcc800';

        //========================
        //  マップデータ見栄え用　マップ画像から左上から0,1,0,2.....と表示するマップチップを変更できる

        //map1.png用
        var block = [
            [35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35],
            [35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35],
            [35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35],
            [35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35],
            [35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35],
            [35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35],
            [35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35],
            [35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35],
            [35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35],
            [35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35],
            [35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35],
            [35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35],
            [35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35],
            [35,35,35, 2, 2, 2,35,35, 2, 2,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35],
            [35,35,35,35,35,35,35,35, 2, 2, 2,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35],
            [35,35,35,35,35,35,35, 2, 2, 2, 2, 2,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35],
            [35,35,35,35,35,35, 2, 2, 2, 2, 2, 2, 2,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35,35],
            [ 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
            [ 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1],
            [ 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1]
        ];

        /*map2.png用
        var block = [
            [ 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8],
            [ 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8],
            [ 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8],
            [ 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8],
            [ 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8],
            [ 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8],
            [ 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8],
            [ 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8],
            [ 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8],
            [ 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8],
            [ 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8],
            [ 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8],
            [ 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8],
            [ 8, 8, 8,32,32,32, 8, 8,32,32, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8],
            [ 8, 8, 8, 8, 8, 8, 8, 8,32,32,32, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8],
            [ 8, 8, 8, 8, 8, 8, 8,32,32,32,32,32, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8],
            [ 8, 8, 8, 8, 8, 8,32,32,32,32,32,32,32, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8],
            [16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16],
            [16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16],
            [16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16,16]
        ];
        */

        //マップデータ判定用　左端は見えない壁作ってこれ以上行けないように
        var col_block = [
            [1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
            [1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
            [1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
            [1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
            [1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
            [1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
            [1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
            [1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
            [1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
            [1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
            [1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
            [1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
            [1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
            [1,0,0,1,1,1,0,0,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
            [1,0,0,0,0,0,0,0,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
            [1,0,0,0,0,0,0,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
            [1,0,0,0,0,0,1,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
            [1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],
            [1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],
            [1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1]
        ];
        //========================




        backgroundMap = new Map(16, 16);//マップ配置用のクラス
        backgroundMap.image = game.assets['../img/map/map2.png'];
        backgroundMap.loadData(block);
        backgroundMap.collisionData = col_block;


        var Gilbert = new Sprite(32, 32);//プレイヤークラスenchant.jsではSpriteで管理
        var Gil_firstposition = [64,140]//プレイヤーの初期スポーン位置
        //goalflagの設定
        var goalflag = new Sprite(32,32);
        goalflag.image = game.assets["../img/character/Gilbert2.png"];
        goalflag.x = 200;
        goalflag.y =240;

        //弾を打ってから10フレーム後にtrueになる
        var frame_flag = true;
        //弾を打ってからフレームを数える
        var frame_count = 0;
        
        
        Gilbert.image = game.assets["../img/character/Gilbert2.png"];
        Gilbert.x = Gil_firstposition[0];
        Gilbert.y = Gil_firstposition[1];
        Gilbert.prey = Gil_firstposition[1];
        //Gilbert.ay = 50;
        Gilbert.frame = 1;//プレイヤーのアニメーションの画像　これを変更するとプレイヤーの画像が変わってモーションが作れる（歩くとか）
        Gilbert.jumpFlg = false;//ジャンプしてるかどうかのフラグ
        Gilbert.jumpingFlg = false;//ジャンプ中がどうかのフラグ
        Gilbert.jumpPower = 8; //プレイヤーのジャンプ力　大きくするほど高く飛べる
        Gilbert.addEventListener(Event.ENTER_FRAME, function(e) {

            //
            if (game.input.up && Gilbert.jumpingFlg === false) {
               Gilbert.jumpFlg = true;
            }

            if (game.input.right) {
                 //→キー
                if(backgroundMap.hitTest(Gilbert.x+30 ,Gilbert.y + 30 )){
                }else{
                    if(Gilbert.jumpingFlg){
                        Gilbert.x += 4;
                        Gilbert.scaleX = 1;
                    }else{
                        Gilbert.frame = (Gilbert.age%5) + 1;
                        Gilbert.x += 4;
                        Gilbert.scaleX = 1;
                    }

                }
            }
            if (game.input.left) {
                //←キー
                if(backgroundMap.hitTest(Gilbert.x+5 ,Gilbert.y + 30 )){
                }else{
                    if(Gilbert.jumpingFlg){
                        Gilbert.x -= 4;
                        Gilbert.scaleX = -1;
                    }else{
                        Gilbert.frame = (Gilbert.age%5) + 1;
                        Gilbert.x -= 4;
                        Gilbert.scaleX = -1;
                    }


                }
            }
            //=============
            //ジャンプ処理
            //=============
            if(Gilbert.jumpFlg){
                if(!Gilbert.jumpingFlg){
                    Gilbert.jumpingFlg = true;
                    Gilbert.prey = Gilbert.y;
                }else{
                    //y座標を決める処理
                    if(Gilbert.jumpPower>3){
                        //上昇中
                        Gilbert.frame = 27
                    }else if(Gilbert.jumpPower <= 3 && Gilbert.jumpPower > 0){
                        //頂上付近、ブロックから下り始めも
                        Gilbert.frame = 28
                    }else if(Gilbert.jumpPower<=0){
                        //下降中
                        Gilbert.frame = 29
                    }
                    Gilbert.y = Gilbert.prey - Gilbert.jumpPower--;

                    //y座標が衝突する場合
                    while(backgroundMap.hitTest(Gilbert.x+16 ,Gilbert.y + 32 )){
                        Gilbert.y = Gilbert.prey - (++Gilbert.jumpPower);
                        if(!backgroundMap.hitTest(Gilbert.x+16 ,Gilbert.y + 32 )){
                            Gilbert.y++;
                            Gilbert.jumpingFlg = false;
                            Gilbert.jumpFlg = false;
                            Gilbert.jumpPower = 8;
                            Gilbert.frame = 30
                            break;
                        }
                    }
                    Gilbert.prey = Gilbert.y;
                }
            }

            //===========================================
            //足元に地面がない場合はジャンプ中とみなす
            //ただし上には飛べないのでjumpPowerは0とする
            //===========================================
            if(!backgroundMap.hitTest(Gilbert.x+16 ,Gilbert.y + 32 ) && Gilbert.jumpingFlg !== true){
                Gilbert.jumpFlg = true;
                Gilbert.jumpPower = 0;
            }
            
            //===========================================
            //弾の発射処理
            //間隔を10フレーム開けて発射する
            //
            //===========================================

            var bullet;

            if(frame_flag==true){
                //frame_flagがtrueかつaボタン（Zキー）が押された時
                if ( game.input.a ) {
                    frame_flag = false
                    //frame_flagをfalseする
                    //hitABullet関数を実行
                    hitABullet();
                }

            }
            
            //上で呼ばれるhitABullet関数作成
            function hitABullet() {
                //弾を作成
                bullet = new Bullet();
	            stage.addChild( bullet );
            
            }

            //前回弾を打ってから10フレーム未満の場合
            if(frame_flag==false){
                
                frame_count = frame_count + 1;
                
            }

            //前回弾を打ってから10フレームたった場合
            if(frame_count == 10){

                frame_flag = true;
                frame_count = 0;

            }


            //===========================================
            //ゴール処理
            //===========================================
            if(Gilbert.x >= goalflag.x && Gilbert.x < goalflag.x+3){
    
                alert("gameclear");

            }
        });

        //===========================================
        //弾のクラス作成
        //===========================================
        var Bullet = Class.create( Sprite, {
            initialize: function() {
                var bulletX, bulletY;	//弾のX座標とY座標
                Sprite.call( this, 32, 32 );	//Spriteクラスのメソッドを、thisでも使えるようにする
                this.image = game.assets["../img/character/Gilbert2.png"];	//スプライトの画像ファイルを指定
                //プレイヤーの向きによって弾の位置や動かす方向を変える
                if ( Gilbert.scaleX >= 0 ) {
                    this.speed = 10;
                    bulletX = Gilbert.x + 5;
                } else {
                    this.speed = -10;
                    bulletX = Gilbert.x - 5;
                }
                bulletY = Gilbert.y + 0;
                this.moveTo( bulletX, bulletY );	//弾の位置
            },
            onenterframe: function() {

                this.x += this.speed;	//弾の移動

                //弾の位置が座標で150以上又は0以下になった時に弾を削除
                if(this.x >= 150 || this.x <= 0){

                    stage.removeChild(this);

                }

            }

        } );

        var stage = new Group();//マップとキャラクターを同時に管理するためにグループとして統括（スクロールするときに必要）
        stage.addChild(backgroundMap);
        stage.addChild(Gilbert);

        //プレイヤーのX座標に合わせて画面をスクロール
        stage.addChild(goalflag);
    
        stage.addEventListener(Event.ENTER_FRAME, function(e) {
        if(stage.x > 128 - Gilbert.x){
            stage.x = 128 - Gilbert.x;
        }else if(stage.x < 46 - Gilbert.x){
            stage.x = 46 - Gilbert.x;
        }


        });

        scene.addChild(stage);

        scene.backgroundColor = 'black';	//シーンを黒く塗りつぶす


		return scene;
	}
    game.start();	//ゲームスタート
});
